#!/bin/bash
t0='\033[0m'
t1='\033[1m'
t2='\033[2m'
t4='\033[4m'
t5='\033[5m'
t7='\033[7m'
t8='\033[8m'
t22='\033[22m'
t24='\033[24m'
t25='\033[25m'
t27='\033[27m'
t30='\033[30m'
t31='\033[31m'
t32='\033[32m'
t33='\033[33m'
t34='\033[34m'
t35='\033[35m'
t36='\033[36m'
t37='\033[37m'
t40='\033[40m'
t41='\033[41m'
t42='\033[42m'
t43='\033[43m'
t44='\033[44m'
t45='\033[45m'
t46='\033[46m'
t47='\033[47m'

echo -e "$t0 测试用文字0 ${t0}"
echo -e "$t1 测试用文字1 ${t0}"
echo -e "$t2 测试用文字2 ${t0}"
echo -e "$t4 测试用文字4 ${t0}"
echo -e "$t5 测试用文字5 ${t0}"
echo -e "$t7 测试用文字7 ${t0}"
echo -e "$t8 测试用文字8 ${t0}"
echo -e "$t22 测试用文字22 ${t0}"
echo -e "$t24 测试用文字24 ${t0}"
echo -e "$t25 测试用文字25 ${t0}"
echo -e "$t26 测试用文字26 ${t0}"
echo -e "$t27 测试用文字27 ${t0}"
echo -e "$t30 测试用文字30 ${t0}"
echo -e "$t31 测试用文字31 ${t0}"
echo -e "$t32 测试用文字32 ${t0}"
echo -e "$t33 测试用文字33 ${t0}"
echo -e "$t34 测试用文字34 ${t0}"
echo -e "$t35 测试用文字35 ${t0}"
echo -e "$t36 测试用文字36 ${t0}"
echo -e "$t37 测试用文字37 ${t0}"
echo -e "$t40 测试用文字40 ${t0}"
echo -e "$t41 测试用文字41 ${t0}"
echo -e "$t42 测试用文字42 ${t0}"
echo -e "$t43 测试用文字43 ${t0}"
echo -e "$t44 测试用文字44 ${t0}"
echo -e "$t45 测试用文字45 ${t0}"
echo -e "$t46 测试用文字46 ${t0}"
echo -e "$t47 测试用文字47 ${t0}"
